{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/12/18/hello-world/"},{"title":"git init으로 프로젝트 시작하기 vs git clone으로 프로젝트 시작하기","text":"상황 설명 로컬에서 hexo blog framework로 blog 구축 project를 시작함. github에서 github blog 생성하기 위해 repo 생성. 위의 원격 repo에 hexo-deployer-git plugin을 사용하여 deploy함. hexo project에서 static file들은 public폴더에서 관리하므로, git으로 버전 관리를 하기 위해 public 폴더에 git init 시전. 에러 메세지들 123$ git push origin mainerror: src refspec main does not match anyerror: failed to push some refs to 'https://github.com/bongsee/bongsee.github.io.git' remote에는 master branch가 없기 때문에 출력된 에러 메세지 123456789$ git push origin mainTo https://github.com/bongsee/bongsee.github.io.git ! [rejected] main -&gt; main (fetch first)error: failed to push some refs to 'https://github.com/bongsee/bongsee.github.io.git'hint: Updates were rejected because the remote contains work that you dohint: not have locally. This is usually caused by another repository pushinghint: to the same ref. You may want to first integrate the remote changeshint: (e.g., 'git pull ...') before pushing again.hint: See the 'Note about fast-forwards' in 'git push --help' for details. remote에 있는 것들이 당연하게 내 local에도 있어야 하는데, 없으니까 일단 pull로 땡겨와라. 라는 메세지 12345678910$ git pull origin mainremote: Enumerating objects: 46, done.remote: Counting objects: 100% (46/46), done.remote: Compressing objects: 100% (27/27), done.remote: Total 46 (delta 9), reused 46 (delta 9), pack-reused 0Unpacking objects: 100% (46/46), 129.91 KiB | 601.00 KiB/s, done.From https://github.com/bongsee/bongsee.github.io * branch main -&gt; FETCH_HEAD * [new branch] main -&gt; origin/mainfatal: refusing to merge unrelated histories 관련 없는 기록 병합 거부 remote의 commit history와 local의 commit history가 관련성이 없기 때문에 merge하는데 실패하는 것 12345678$ git push origin mainTo https://github.com/bongsee/bongsee.github.io.git ! [rejected] main -&gt; main (non-fast-forward)error: failed to push some refs to 'https://github.com/bongsee/bongsee.github.io.git'hint: Updates were rejected because the tip of your current branch is behindhint: its remote counterpart. Integrate the remote changes (e.g.hint: 'git pull ...') before pushing again.hint: See the 'Note about fast-forwards' in 'git push --help' for details. 힌트 : 현재 지점의 끝이 원격 지점 뒤에 있기 때문에 업데이트가 거부되었습니다. 다시 푸시하기 전에 원격 변경 사항을 통합하십시오. rejected : push가 거부되었다. master -&gt; master : 로컬 저장소의 master 브랜치의 변경 사항을 원격 저장소의 master 브랜치에 반영하려 했는데 non-fast-forward : 원격 저장소의 master 브랜치가 로컬 저장소의 버전보다 이전 버전이 아니다. 라는 의미이다. 그럼 git push는 내부적으로 어떻게 할지말지를 판단하나 ? push 명령은 로컬 저장소의 commit 목록과 원격 저장소의 commit 목록을 비교한다.그런 다음 원격 저장소의 마지막 commit id와 동일한 commit id를 가진 로컬 저장소의 commit 시점을 찾아낸 뒤, 원격 저장소의 마지막 커밋과 연결한다. 정리 애초에 접근부터가 잘못됐다. 원격 repo에서 프로젝트를 시작했으면, 해당 repo를 clone해와서 repo와 local을 동기화시킨 이후에 작업을 해야하는 것이고, local에서 프로젝트를 시작했으면, remote에 대한 설정과 upstream 링크를 걸어주는 등의 작업을 직접해야하는 것이다. 아~ 최우영 강사님,, 이제야 깨닫습니다. 왜 remote에서 시작해서 clone하는게 편한지요… Refs https://jobc.tistory.com/177","link":"/2022/12/19/221219_error_git/"}],"tags":[{"name":"error","slug":"error","link":"/tags/error/"},{"name":"git","slug":"git","link":"/tags/git/"}],"categories":[],"pages":[]}